app/views/contestants/show.html.erb

SELECT "contestant_entries".* FROM "contestant_entries" WHERE "contestant_entries"."contestant_id" = 7
---
  <%= @contestant.email %>
  <% @contestant.contestant_entries.each do |entry| %>