app/views/contestant_entries/index.html.erb

SELECT "contestant_entries".* FROM "contestant_entries" WHERE "contestant_entries"."contestant_id" = 1
SELECT "contestants".* FROM "contestants"
---
      <td>
      <% contestant.contestant_entries.each do | entry | %>