app/controllers/contestants_controller.rb

  def show
    @contestant = Contestant.find(params[:id])
---
SELECT "contestants".* FROM "contestants" WHERE "contestants"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @contestant = get_customer_by_email_param
    @contestant_entry = @contestant.contestant_entries.build(params[:contestant_entry])
    if @contestant.save
---
INSERT INTO "contestant_entries" ("address", "city", "contest_source", "contestant_id", "created_at", "first_name", "last_name", "location", "phone", "photo_content_type", "photo_file_name", "photo_file_size", "photo_update_at", "photographer", "rating", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "contestants" ("address", "city", "contest_source", "created_at", "email", "first_name", "last_name", "location", "phone", "photographer", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)