app/controllers/contestant_entries_controller.rb

  def index
    #@contestants = Contestant.find(:all)
    @contestants = Contestant.paginate(:page => params[:page], :per_page => 2)
---
SELECT "contestants".* FROM "contestants"

  def update
   #@contestants = Contestant.find(:all)
   @contestants = Contestant.paginate(:page => params[:page], :per_page => 2)

   entry = ContestantEntry.find(params[:id])
   entry.rating = params[:contestant_entry][:rating]

   if entry.save
      render 'index'
   else
     entry.errors.each do |err|
      flash[:now] = err.to_s
     end
     flash[:now] += "  Photo size " + entry.photo.size
---
SELECT "contestants".* FROM "contestants"
SELECT "contestant_entries".* FROM "contestant_entries" WHERE "contestant_entries"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "contestant_entries" SET "rating" = 10, "updated_at" = '2011-10-25 18:15:52.213200' WHERE "contestant_entries"."id" = 1
SELECT COUNT(*) FROM "contestant_entries" WHERE "contestant_entries"."contestant_id" = 1